package pkg;

public class Main {

	public static void main(String[] args) {
		/*
		 * 10월 16일(월) ~ 10월 22일(일) 회고록
		 * 
		 * 이번 주는 프로세스, 스레드, 커널에 대해 공부를 하였다.
		 * 아무래도 우리 회사의 주요 기술은 스레드를 잘 활용하는 것이다보니
		 * 스레드에 대한 공부가 꼭 필요한 부분이 있었다.
		 * 
		 * 이번 기회에 확실히 알게 되어 좋았다.
		 * 그리고 이제 우리 회사 DB테이블을 업무 프로세스와 비교하여 알아가는 교육을 받았다.
		 * 사실 교육이라기 보다는 그냥 한번 쓱 훑은 것 밖에는 없지만,
		 * 그래도 이렇게 알아보니 도움이 많이 되었다.
		 * 
		 * 열심히 공부하고 소스 코드를 빠르게 이해하여 팀에 도움이 되게끔 해야겠다.
		 * 다음 달부터는 선배와 현장에 나가는 일이 생긴다는데~ 참 설레기도 하고 걱정이 되기도 한다.
		 * 내가 잘할 수 있으면 좋겠다.
		 * 
		 * 다음주는 추가로 리눅스 명령어 50개 정도 외워 공부할 예정이다.
		 * 리눅스에 대한 중요성을 강조하시는 것 보면, 머지 않아 업무에서 활용할 일이 있을 것 같다.
		 * 
		 * 그럼 오늘도 화이팅하자 !
		 * 
		 * 
		 */
	}

}
